# مرحله ۱: انتخاب نسخه سبک و امن Node.js به عنوان پایه
FROM node:18-alpine

# مرحله ۲: مشخص کردن پوشه کاری اصلی در داخل کانتینر
WORKDIR /app

# مرحله ۳: کپی کردن فایل‌های پیکربندی بک‌اند برای نصب کتابخونه‌ها
# اول فقط اینا رو کپی می‌کنیم تا از کش داکر خوب استفاده کرده باشیم
COPY server/package*.json ./

# مرحله ۴: نصب تمام کتابخونه‌های مورد نیاز
RUN npm install

# مرحله ۵: کپی کردن بقیه سورس کدهای بک‌اند
COPY server/ .

# مرحله ۶: به داکر می‌گیم که برنامه ما روی پورت 8080 گوش میده
EXPOSE 8080

# مرحله ۷: دستور اجرای برنامه
CMD ["node", "index.js"]
